{
  "basics": {
    "name": "Kartikay Jainwal",
    "label": "Software Engineer",
    "picture": "https://i.imgur.com/e2EHa8p.jpg",
    "email": "kartikayjainwal@gmail.com",
    "phone": "07576681965",
    "website": "kjainwal.com",
    "summary": "Highly motivated fullstack software developer with a creative problem solving mindset gained from several years of industry experience. Hardworking and enthusiastic individual with a passion for technology and innovation. Ability to work with multiple programming languages and eager to learn more. Strong experience in fullstack JavaScript including TypeScript, React, Node, Express and more.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "London",
      "countryCode": "UK",
      "region": ""
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "KJainwal",
        "url": "https://www.linkedin.com/in/kjainwal"
      },
      {
        "network": "Github",
        "username": "Yakitrak",
        "url": "https://github.com/Yakitrak"
      }
    ]
  },
  "work": [
    {
      "company": "Sainsburys",
      "location": "London",
      "description": "",
      "position": "Software Engineer",
      "website": "https://www.sainsburys.co.uk/",
      "startDate": "2022-01",
      "endDate": "",
      "summary": "",
      "highlights": [
        "Developed features on full stack web applications using TypeScript with React, Redux frontend and NodeJS, ExpressJS, and GraphQL backend. Extensively tested using react-testing-library, Jest, Cypress, Cucumber etc. Took responsibility for deployments on AWS.",
        "Maintained projects and supported on incidents raised for applications ensuring any issues are fixed and the corresponding teams are updated.",
        "Responsible for keeping the team aligned with meeting, sprint and support management responsibilities. Also supported junior members of the team and involved with interview process.",
        "Volunteered as Wellbeing champion to promote and disseminate information to colleagues regarding maintaining and improving wellbeing. This also involved providing listening ear for team members and signposting when required."
      ]
    },
    {
      "company": "Tech City Ventures",
      "location": "London",
      "description": "",
      "position": "Fullstack Software Developer",
      "website": "https://www.linkedin.com/company/techcityventures/",
      "startDate": "2020-10",
      "endDate": "2021-12",
      "summary": "",
      "highlights": [
        "Implemented core functionality across multiple web platforms, integrating APIs and developing new features in packages and microservices to support modular code design.",
        "Developed web applications or packages used JavaScript, React, Redux, React-Router, StorybookJS documentation, Node, Express, GItlab CI/CD, MongoDB, Docker, Kubernetes and Helm.",
        "Took ownership of projects working fullstack from frontend to backend to deployment (Used Agile methodology via JIRA to assign and track tasks)",
        "Supported junior developers and created tools to set standards and automate repetitive tasks"
      ]
    },
    {
      "company": "Transalis",
      "location": "Portsmouth",
      "description": "",
      "position": "Software Developer",
      "website": "https://www.transalis.com/",
      "startDate": "2019-07",
      "endDate": "2020-10",
      "summary": "",
      "highlights": [
        "Integrated new EDI customers with existing solutions and developed bespoke solutions (create / consume REST APIs for large scale critical projects based on client requirements).",
        "Developed advanced fullstack CRUD web applications to allow non-EDI educated business staff to handle internal operations.",
        "Worked within teams and independently took ownership on multiple projects communicating with clients directly to identify project deliverables and meet deadlines (Using Trello to manage tasks and deadlines).",
        "Used a range of technologies depending on project or task including JavaScript, React, Node, Express, Java, MongoDB, and XSLT / JSON."
      ]
    },
    {
      "company": "The Carto Group",
      "location": "Swindon, UK",
      "description": "",
      "position": "Junior Software Developer",
      "website": "https://www.linkedin.com/company/cartoconsult-limited/",
      "startDate": "2017-09",
      "endDate": "2018-08",
      "summary": "",
      "highlights": [
        "Created GIS based web applications for multiple projects and a large scale project (Using Trello to manage tasks and deadlines).",
        "Web applications utilised a Node Express Backend with a PostgreSQL database and a React Frontend using Redux and Material Design guidelines.",
        "Scripted tools to automate tedious processes using python."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "The University of Portsmouth",
      "area": "Software Engineering",
      "studyType": "BSc(hons)",
      "startDate": "2015-08",
      "endDate": "2020-07",
      "gpa": "First Classification",
      "courses": []
    },
    {
      "institution": "New College",
      "area": "Software Development",
      "studyType": "BTEC Level 3",
      "startDate": "2013-08",
      "endDate": "2015-07",
      "gpa": "Triple Distinction Star",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Technical Skills",
      "level": "",
      "keywords": [
        "JavaScript | TypeScript",
        "React | Redux",
        "Node | Express | GraphQL",
        "Jest | Cucumber | Cypress",
        "HTML5 | CSS3 | SCSS",
      "MongoDB | PostGreSQL | Kafka",
        "Docker | Github | AWS",
        "Java | C# | Python"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native"
    },
    {
      "language": "Hindi",
      "fluency": "Native"
    }
  ],
  "interests": [
    {
      "name": "Ukulele",
      "keywords": []
    },
    {
      "name": "Reading",
      "keywords": []
    },
    {
      "name": "Fitness",
      "keywords": []
    }
  ],
  "references": [],
  "projects": []
}
